config/cf/InformationRegisters/РС_ОповещениеОНовомЗвонке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>РС_ОповещениеОНовомЗвонке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПользователяАТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/cf/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Documents/ТелефонныйЗвонок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ТелефонныйЗвонок</Name>
			<BasedOn>
				<xr:Item>Document.Встреча</xr:Item>
				<xr:Item>Document.ТелефонныйЗвонок</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоВходящее</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоИсходящее</xr:Item>
				<xr:Item>Document.ЗапланированноеВзаимодействие</xr:Item>
				<xr:Item>Document.СообщениеSMS</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АбонентКакСвязаться</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентКонтакт</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтактВзаимодействия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Входящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаимодействиеОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.Задание</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапланированноеВзаимодействие</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.Встреча</v8:Type>
						<v8:Type>cfg:DocumentRef.СообщениеSMS</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпCoMagicID</Name>
					<Comment>Идентификатор контакта в системе CoMagic</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпДлительностьЗвонка</Name>
					<Comment>Длительность звонка в секундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпИдентификаторЗаписи</Name>
					<Comment>Идентификатор записи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпИдентификаторЗвонка</Name>
					<Comment>Идентификатор звонка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпСостояниеЗвонка</Name>
					<Comment>Состояние звонка</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.сфпСостоянияЗвонков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РС_UUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РС_ВнутреннийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РС_ИдентификаторПользователяАТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/cf/WebServices/РС_СообщениеАТС/Ext/Module.bsl
//++ 07.01.2021, Тарасов Михаил: подключение телефонии Дом.РУ к DevBase
Функция ПолучитьСообщение(ИдентификаторПользователяАТС, ТелефонКлиента, Тип, ВнутреннийНомер, IDЗвонка)
	
	Если Тип = "OUTGOING" Тогда
		МенеджерЗаписи = РегистрыСведений.РС_ОповещениеОНовомЗвонке.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.UUID = IDЗвонка; 
		МенеджерЗаписи.Записать(Истина);
		Возврат "";
	КонецЕсли;
	
	ТаблицаСообщений = Новый ТаблицаЗначений;
	ТаблицаСообщений.Колонки.Добавить("ИдентификаторПользователяАТС", новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	ТаблицаСообщений.Колонки.Добавить("ВнутреннийНомер", новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(15)));
	ТаблицаСообщений.Колонки.Добавить("IDЗвонка", новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
	ТаблицаСообщений.Колонки.Добавить("КонтактныйТелефон", новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(СтрДлина(СокрЛП(ТелефонКлиента)))));
	СтрокаТаблицыСообщений = ТаблицаСообщений.Добавить();
	СтрокаТаблицыСообщений.ИдентификаторПользователяАТС = ИдентификаторПользователяАТС;
	СтрокаТаблицыСообщений.КонтактныйТелефон = СокрЛП(ТелефонКлиента); 
	СтрокаТаблицыСообщений.ВнутреннийНомер = ВнутреннийНомер;
	СтрокаТаблицыСообщений.IDЗвонка = IDЗвонка;
	
	РС_ТелефонныйЗвонокЗавершен = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "РС_ТелефонныйЗвонокЗавершен");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаСообщений.ИдентификаторПользователяАТС КАК ИдентификаторПользователяАТС,
	               |	ТаблицаСообщений.ВнутреннийНомер КАК ВнутреннийНомер,
	               |	ТаблицаСообщений.IDЗвонка КАК IDЗвонка,
	               |	ТаблицаСообщений.КонтактныйТелефон КАК КонтактныйТелефон
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ТаблицаСообщений КАК ТаблицаСообщений
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.ИдентификаторПользователяАТС КАК ИдентификаторПользователяАТС,
	               |	ВТ.ВнутреннийНомер КАК ВнутреннийНомер,
	               |	ВТ.IDЗвонка КАК IDЗвонка,
	               |	ВТ.КонтактныйТелефон КАК КонтактныйТелефон,
	               |	МАКСИМУМ(ЕСТЬNULL(КонтактныеЛицаКонтактнаяИнформация.Ссылка.Владелец, НЕОПРЕДЕЛЕНО)) КАК Контрагент,
	               |	МАКСИМУМ(ЕСТЬNULL(КонтактныеЛицаКонтактнаяИнформация.Ссылка, НЕОПРЕДЕЛЕНО)) КАК КонтактноеЛицо,
	               |	КОЛИЧЕСТВО(ЕСТЬNULL(КонтактныеЛицаКонтактнаяИнформация.Ссылка, НЕОПРЕДЕЛЕНО)) КАК КоличествоКонтактныхЛиц
	               |ПОМЕСТИТЬ ВТ2
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
	               |		ПО (КонтактныеЛицаКонтактнаяИнформация.НомерТелефона = ВТ.КонтактныйТелефон)
	               |			И (КонтактныеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	               |			И (НЕ КонтактныеЛицаКонтактнаяИнформация.Ссылка.ПометкаУдаления)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ.КонтактныйТелефон,
	               |	ВТ.ИдентификаторПользователяАТС,
	               |	ВТ.ВнутреннийНомер,
	               |	ВТ.IDЗвонка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ2.ИдентификаторПользователяАТС КАК ИдентификаторПользователяАТС,
	               |	ВТ2.ВнутреннийНомер КАК ВнутреннийНомер,
	               |	ВТ2.IDЗвонка КАК IDЗвонка,
	               |	ВТ2.КонтактныйТелефон КАК КонтактныйТелефон,
	               |	ВТ2.Контрагент КАК Контрагент,
	               |	ВТ2.КонтактноеЛицо КАК КонтактноеЛицо,
	               |	ВТ2.КоличествоКонтактныхЛиц КАК КоличествоКонтактныхЛиц,
	               |	МАКСИМУМ(ТелефонныйЗвонок.Ссылка) КАК ДокументЗвонка,
	               |	РС_ОповещениеОНовомЗвонке.UUID ЕСТЬ NULL КАК Входящий
	               |ИЗ
	               |	ВТ2 КАК ВТ2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
	               |		ПО ВТ2.IDЗвонка = ТелефонныйЗвонок.РС_UUID
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РС_ОповещениеОНовомЗвонке КАК РС_ОповещениеОНовомЗвонке
	               |		ПО ВТ2.IDЗвонка = РС_ОповещениеОНовомЗвонке.UUID
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ2.ИдентификаторПользователяАТС,
	               |	ВТ2.КонтактныйТелефон,
	               |	ВТ2.Контрагент,
	               |	ВТ2.КонтактноеЛицо,
	               |	ВТ2.КоличествоКонтактныхЛиц,
	               |	ВТ2.IDЗвонка,
	               |	ВТ2.ВнутреннийНомер,
	               |	РС_ОповещениеОНовомЗвонке.UUID ЕСТЬ NULL";
		
	Запрос.УстановитьПараметр("ТаблицаСообщений", ТаблицаСообщений);
	ВДЗ = Запрос.Выполнить().Выбрать();
	ВДЗ.Следующий();
	
	Если Тип = "ACCEPTED" Тогда
		
		ТекДок = Документы.ТелефонныйЗвонок.СоздатьДокумент();
		ТекДок.Дата = ТекущаяДата();
		ТекДок.АбонентКакСвязаться = ВДЗ.КонтактныйТелефон;
		Если ВДЗ.КоличествоКонтактныхЛиц <= 1 И ЗначениеЗаполнено(ВДЗ.КонтактноеЛицо) Тогда
			ТекДок.АбонентКонтакт = ВДЗ.КонтактноеЛицо;
			ТекДок.АбонентПредставление = "" + ВДЗ.КонтактноеЛицо + " (" + ВДЗ.КонтактноеЛицо.Владелец + ")";
		КонецЕсли;
		Если ВДЗ.Входящий Тогда
			ТекДок.Тема = "[Приём звонка]";
		Иначе
			ТекДок.Тема = "[Инициация звонка]";
		КонецЕсли;
		ТекДок.Входящий = ВДЗ.Входящий;
		ТекДок.Описание = "[Создано автоматически]";
		ТекДок.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		ТекДок.РС_UUID = ВДЗ.IDЗвонка;
		ТекДок.РС_ВнутреннийНомер = ВДЗ.ВнутреннийНомер;
		ТекДок.РС_ИдентификаторПользователяАТС = ВДЗ.ИдентификаторПользователяАТС;
		ТекДок.Записать();
		
		МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект = ТекДок.Ссылка;
		МенеджерЗаписи.Свойство = РС_ТелефонныйЗвонокЗавершен;
		МенеджерЗаписи.Значение = Ложь;
		МенеджерЗаписи.Записать(Истина);
		
	ИначеЕсли Тип = "COMPLETED" Тогда
		
		Если ЗначениеЗаполнено(ВДЗ.ДокументЗвонка) Тогда
			МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Объект = ВДЗ.ДокументЗвонка;
			МенеджерЗаписи.Свойство = РС_ТелефонныйЗвонокЗавершен;
			МенеджерЗаписи.Значение = Истина;
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат "";
КонецФункции
//-- 07.01.2021, Тарасов Михаил: подключение телефонии Дом.РУ к DevBase
